one = 'one'
two = 'two'
mode = 'mode'
name = 'name'
play = 'play'
color = 'color'
point = 'point'
index = 'index'
armed = 'armed'
empty = 'empty'
turbo = 'turbo'
switch = 'switch'
warmup = 'warmup'
region = 'region'
weapon = 'weapon'
trigger = 'trigger'
thermite = 'thermite'
interval = 'interval'
restrain = 'restrain'
category = 'category'  # 需要压枪的武器可以分3类, 1:301这种射击间隔很稳定的枪, 2:哈沃克这种初始需要预热然后射击间隔稳定的枪(装备涡轮后变成301这种), 3:专注这种初始几枪射击间隔逐渐缩小后续保持稳定的枪(装备涡轮后缩小前几枪的射击间隔)
vertical = 'vertical'
horizontal = 'horizontal'

# 检测数据
detect = {
    "3440:1440": {
        play: [  # 判断是否在游戏中
            {
                point: (236, 1344),  # 点的坐标, 血条左上角
                color: 0x00FFFFFF  # 点的颜色, 255, 255, 255
            },
            {
                point: (2692, 1372),  # 生存物品右下角
                color: 0x959595  # 149, 149, 149
            }
        ],
        name: {  # 武器名称判断
            point: (2900, 1372),  # 两把武器时, 1号武器上面边框分界线的上半部分, y+1 就是1号武器上面边框分界线的下半部分
            color: 0x808080,  # 无武器时, 灰色, 128, 128, 128
            one: {  # 1号武器
                region: (2950, 1379, 163, 25),
                166: '3030',  # 数据通过跑 测试.武器识别.一号武器.02.分析.py 即可获得
                111: 'CAR',
                163: 'EVA8',
                196: 'G7',
                379: 'LSTAR',
                274: 'P2020',
                294: 'R301',
                290: 'R99',
                362: 'RE45',
                306: '三重',
                256: '专注',
                358: '克雷贝尔',
                288: '刀刃',
                325: '和平',
                232: '哈沃克',
                308: '哨兵',
                254: '喷火',
                217: '小帮手',
                179: '平行',
                95: '暴走',
                172: '波塞克',
                197: '滋崩',
                273: '猎兽',
                255: '獒犬',
                301: '电能',
                188: '莫桑比克',
                280: '赫姆洛克',
                351: '转换者',
                56: '长弓',
            },
            two: {  # 奇怪的是, 两把武器的纯白色点数居然不一致
                region: (3145, 1379, 163, 25),
                161: '3030',
                109: 'CAR',
                150: 'EVA8',
                197: 'G7',
                367: 'LSTAR',
                271: ['P2020', '电能'],  # 出现了重复的, 需要在下方进一步区分
                282: 'R301',
                276: 'R99',
                330: 'RE45',
                311: '三重',
                241: '专注',
                339: '克雷贝尔',
                307: '刀刃',
                293: '和平',
                251: '哈沃克',
                327: '哨兵',
                239: '喷火',
                199: '小帮手',
                157: '平行',
                91: '暴走',
                186: '波塞克',
                194: '滋崩',
                259: '猎兽',
                224: '獒犬',
                217: '莫桑比克',
                323: '赫姆洛克',
                350: '转换者',
                54: '长弓',
                'P2020': (4, 104),  # (y, x) 的形式, 代码取图片像素点颜色更方便
                '电能': (3, 84),
            }
        },
        mode: {  # 武器模式, 全自动/半自动/单发/其他
            color: 0x00FFFFFF,
            '1': (3151, 1347),  # 全自动
            '2': (3171, 1351),  # 半自动
        },
        armed: {  # 是否持有武器(比如有武器但用拳头就是未持有武器)

        },
        empty: {  # 是否空弹夹(武器里子弹数为0)
            color: 0x00FFFFFF,
            '1': (3204, 1306),  # 十位数, 该点白色即非0, 非0则一定不空
            '2': (3229, 1294),  # 个位数, 该点白色即为0, 十位为0且个位为0为空
        },
        turbo: {  # 涡轮
            color: 0x00FFFFFF,
            '专注': (3072, 1358),  # 专注轻机枪 涡轮检测位置
            '哈沃克': (3034, 1358),  # 哈沃克步枪 涡轮检测位置
        },
        trigger: {  # 双发扳机
            color: 0x00FFFFFF,
            'G7': (3072, 1358),  # G7 侦查枪 双发扳机检测位置
            'EVA8': (3034, 1358),  # EVA-8 双发扳机检测位置
        },
        thermite: {  # 铝热剂(暴走,火力全开)
            color: 0x00F0F0F0,
            '暴走': (3049, 1240),  # 暴走 火力全开检测位置
        }
    },
    "2560:1440": {

    },
    "2560:1080": {

    },
    "1920:1080": {

    }
}

# 武器数据
weapons = {
    'R301': {
        category: 1,
        interval: 75,
        vertical: [15, 15, 10, 10, 10, 5, 0, 0, 5, 5, 5, 10, 5, 0, 0, 0, 0, 10, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        horizontal: [-5, 0, -5, -2, 0, 0, 0, -5, -5, 0, 0, 5, 5, 5, 5, 0, 5, 5, 0, -5, -5, -5, -5, -5, 0, 0, 0],
    },
    '哈沃克': {
        category: 2,
        warmup: 440,
        interval: 92,
        vertical: [10, 15, 15, 15, 15, 10, 10, 10, 10, 5, 0, 0, 0, 0, 0, 5, 5, 5, 0, 0, 10, 10, 10, 10, 10, 10, 5, 5, 5, 0, 0, 0, 5, 5, 5, 0],
        horizontal: [-5, -5, 0, 0, 0, 5, 5, 5, 5, -5, -5, -5, -10, -10, -5, 0, 10, 10, 0, 0, 5, 5, 0, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 1],
    },
    '哈沃克 (涡轮)': {
        category: 1,
        interval: 92,
        vertical: [10, 15, 15, 15, 15, 10, 10, 10, 10, 5, 0, 0, 0, 0, 0, 5, 5, 5, 0, 0, 10, 10, 10, 10, 10, 10, 5, 5, 5, 0, 0, 0, 5, 5, 5, 0],
        horizontal: [-5, -5, 0, 0, 0, 5, 5, 5, 5, -5, -5, -5, -10, -10, -5, 0, 10, 10, 0, 0, 5, 5, 0, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 1],
    },
    '专注': {

    },
    '专注 (涡轮)': {

    },
    '喷火': {
        category: 1,
        interval: 112,
        vertical: [20, 15, 15, 15, 10, 10, 10, 0, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0],
        horizontal: [0, 5, 5, 5, 5, 5, -5, -5, -5, -5, 0, 0, 0, 5, 10, 10, 5, 0, 0, 0, 0, 0, 0, 0, -5, -5, -5, -5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    },
    'R99': {
        category: 1,
        interval: 58,
        vertical: [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 0, 0, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0, 0, 0],
        horizontal: [0, 0, 0, -5, -5, -5, -5, 0, 0, 0, 5, 5, 5, 0, 0, -5, -10, 0, 0, 5, 10, 10, 5, 0, -5, -5, -5, -5],
    },
    '转换者': {
        category: 1,
        interval: 102,
        vertical: [20, 20, 20, 20, 20, 20, 20, 20, 15, 15, 10, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 0],
        horizontal: [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, -5, -5, -5, 0, 0, 0, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0],
    },
    'G7 (双发扳机)': {
        category: 1,
        interval: 50,
        vertical: [20],
        horizontal: [0],
    },
    'CAR': {
        category: 1,
        interval: 65,
        vertical: [15, 15, 15, 15, 15, 10, 10, 10, 10, 10, 5, 10, 0, 0, 0, 5, 5, 5, 5, 5, 5, 5, 5, 10, 10, 10, 10],
        horizontal: [0, 3, 3, 3, 3, 3, 3, 3, -5, -5, -5, -5, -5, 0, 5, 5, 5, -5, -5, -5, 0, 0, 0, 0, 0, 0, 0],
    },
    '猎兽': {
        category: 1,
        interval: 50,
        vertical: [20, 15, 10, 10, 10],
        horizontal: [0, 0, 0, 0, 0],
    },
    '赫姆洛克': {
        category: 1,
        interval: 50,
        vertical: [15, 10, 10],
        horizontal: [0, 0, 0],
    },
    '平行': {
        category: 1,
        interval: 100,
        vertical: [10, 10, 10, 10, 10, 10, 0, 0, 0, 5, 5, 5, 0, 0, 0, 5, 5, 5, 0, 0, 5, 5, 5, 5, 5, 5, 5, -5, 5, 5],
        horizontal: [0, 5, 5, 5, 5, -5, -5, -5, -5, 0, 5, 5, 5, 5, 0, 5, 5, 5, 0, 0, -5, -5, -5, -0, 5, 5, 5, -5, -5, -5],
    },
    'LSTAR': {
        category: 1,
        interval: 112,
        vertical: [10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10],
        horizontal: [12, 12, 10, 0, -10, -10, -10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
    },
    '电能': {
        category: 1,
        interval: 85,
        vertical: [15, 15, 15, 15, 15, 10, 10, 10, 10, 10, 5, 5, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
        horizontal: [-5, 0, 0, 0, 0, -5, -5, -5, 0, 5, 5, 5, 5, 0, 0, 0, 0, 0, 0, 0, 0, 5, 5, 5, 0, 0],
    },
    'RE45': {
        category: 1,
        interval: 64,
        vertical: [10, 10, 10, 10, 10, 8, 8, 8, 8, 8, 5, 5, 5, 5, 5, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3],
        horizontal: [-2, -2, -2, -4, -6, -5, -5, -5, -5, -5, -5, -5, -5, -5, -5, -5, 0, 0, 0, 0, -5, -5, -5, -5, -5],
    },
    '暴走': {

    },
    '暴走 (火力全开)': {

    },
}
